pipl(500001, 'Павел /Милько/').
pipl(500002, 'Анна /Сорокина/').
pipl(500003, 'Максим /Гамалей/').
pipl(500004, 'Дмитрий /Гамалей/').
pipl(500005, 'Ирина /Дронова/').
pipl(500006, 'Анатолий /Гамалей/').
pipl(500007, 'Юлия /Епифанова/').
pipl(500008, 'Михаил /Дронов/').
pipl(500009, 'Елена /Яркина/').
pipl(500010, 'Федот /Гамалей/').
pipl(500011, 'Ульяна //').
pipl(500012, 'Григорий /Гамалей/').
pipl(500013, 'Иван /Гамалей/').
pipl(500014, 'Пётр /Гамалей/').
pipl(500015, 'Николай /Гамалей/').
pipl(500016, 'Владимир /Гамалей/').
pipl(500019, 'Маргарита /Епифанова/').
pipl(500020, 'Мария /Епифанова/').
pipl(500021, 'Наталья //').
pipl(500023, 'Андрей //').
pipl(500024, 'Евгений /Макеев/').
pipl(500026, 'Николай /Яркин/').
pipl(500027, 'Мария /Яркина/').
pipl(500028, 'Екатерина /Яркина/').
pipl(500029, 'Тамара /Яркина/').
pipl(500030, 'Александр /Яркин/').
pipl(500031, 'Владимир /Яркин/').
pipl(500032, 'Алексей /Яркин/').
pipl(500033, 'Некто /Дронов/').
pipl(500035, 'Антонина /Брославская/').
pipl(500036, 'Сергей /Каназенко/').
pipl(500038, 'Нина /Каназенко/').
pipl(500039, 'Светлана /Макеева/').
pipl(500040, 'Андрей /Гамалей/').
pipl(500041, 'Татьяна /Брагина/').
pipl(500042, 'Александр /Щербаков/').
pipl(500043, 'Борис /Щербаков/').
pipl(500044, 'Регина //').
pipl(500045, 'Кирилл /Гамалей/').
pipl(500046, 'Андрей /Гамалей/').
pipl(500047, 'Кристина //').
pipl(500048, 'Александр /Лукин/').
pipl(500050, 'Мария /Яркина/').
pipl(500051, 'Ирина /Сорокина/').
pipl(500052, 'Лидия /Буканова/').
pipl(500054, 'Алексей /Илларионов/').
pipl(500055, 'Михаил /Сорокин/').
pipl(500056, 'Анатолий /Сорокин/').
pipl(500057, 'Вячеслав /Сорокин/').
pipl(500058, 'Людимла /Николина/').
pipl(500059, 'Марина /Сорокина/').
pipl(500060, 'Варвара /Григараш/').
pipl(500061, 'Кирилл /Григараш/').
pipl(500062, 'Светлана /Сорокина/').
pipl(500063, 'Артём /Гамалей/').
pipl(500064, 'Евгения /Надеждина/').
pipl(500065, 'Анастасия /Гамалей/').
pipl(500066, 'Дарья /Гамалей/').
pipl(500067, 'Роман /Гамалей/').
pipl(500068, 'ДЕД /Епифанов/').
mother(500021, 0).
mother(500038, 0).
mother(500039, 0).
mother(500047, 0).
mother(500050, 0).
mother(500060, 0).
mother(500062, 0).
mother(500065, 0).
mother(500066, 0).
mother(500002, 500001).
mother(500002, 500067).
mother(500005, 500003).
mother(500005, 500063).
mother(500007, 500004).
mother(500007, 500040).
mother(500009, 500005).
mother(500011, 500006).
mother(500011, 500012).
mother(500011, 500013).
mother(500011, 500014).
mother(500011, 500015).
mother(500011, 500016).
mother(500019, 500021).
mother(500019, 500023).
mother(500020, 500024).
mother(500020, 500039).
mother(500027, 500009).
mother(500027, 500028).
mother(500027, 500029).
mother(500027, 500030).
mother(500027, 500031).
mother(500027, 500032).
mother(500035, 500038).
mother(500035, 500036).
mother(500041, 500045).
mother(500041, 500046).
mother(500041, 500047).
mother(500029, 500042).
mother(500044, -1).
mother(500028, 500048).
mother(500028, 500050).
mother(500051, 500002).
mother(500052, 500051).
mother(500052, 500056).
mother(500052, 500057).
mother(500058, 500059).
mother(500059, 500062).
mother(500059, 500060).
mother(500064, 500065).
mother(500064, 500066).
father(500003, 500001).
father(500003, 500067).
father(500004, 500003).
father(500004, 500063).
father(500006, 500004).
father(500006, 500040).
father(500008, 500005).
father(500010, 500006).
father(500010, 500012).
father(500010, 500013).
father(500010, 500014).
father(500010, 500015).
father(500010, 500016).
father(500068, 500007).
father(500068, 500019).
father(500068, 500020).
father(500026, 500009).
father(500026, 500028).
father(500026, 500029).
father(500026, 500030).
father(500026, 500031).
father(500026, 500032).
father(500033, 500008).
father(500033, 500035).
father(500040, 500045).
father(500040, 500046).
father(500040, 500047).
father(500043, 500042).
father(500042, -1).
father(500054, 500002).
father(500055, 500051).
father(500055, 500056).
father(500055, 500057).
father(500056, 500059).
father(500061, 500062).
father(500061, 500060).
father(500063, 500065).
father(500063, 500066).
father(500001, 0).
father(500012, 0).
father(500013, 0).
father(500014, 0).
father(500015, 0).
father(500016, 0).
father(500023, 0).
father(500024, 0).
father(500030, 0).
father(500031, 0).
father(500032, 0).
father(500036, 0).
father(500045, 0).
father(500046, 0).
father(500048, 0).
father(500057, 0).
father(500067, 0).
